marius9043/STM32G431CB_FDCAN/meClock_G431.h
// #include "stm32g4xx.h"

// extern "C" void SystemClock_Config(void)
// {
//   RCC_OscInitTypeDef RCC_OscInitStruct = {};
//   RCC_ClkInitTypeDef RCC_ClkInitStruct = {};

//   /** Configure the main internal regulator output voltage
//    */
//   // HAL_PWREx_ControlVoltageScaling(PWR_REGULATOR_VOLTAGE_SCALE1_BOOST);
//   HAL_PWREx_ControlVoltageScaling(PWR_REGULATOR_VOLTAGE_SCALE1);

//   /** Initializes the RCC Oscillators according to the specified parameters
//    * in the RCC_OscInitTypeDef structure.
//    */
//   // //RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSE;
//   // //RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSI48|RCC_OSCILLATORTYPE_HSE;
//   // RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSE;
//   // RCC_OscInitStruct.HSEState = RCC_HSE_ON;
//   // //RCC_OscInitStruct.HSI48State = RCC_HSI48_ON;
//   // RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
//   // RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSE;
//   // RCC_OscInitStruct.PLL.PLLM = RCC_PLLM_DIV2;
//   // RCC_OscInitStruct.PLL.PLLN = 75; // 85
//   // RCC_OscInitStruct.PLL.PLLP = RCC_PLLP_DIV2;
//   // RCC_OscInitStruct.PLL.PLLQ = RCC_PLLQ_DIV2; //4
//   // RCC_OscInitStruct.PLL.PLLR = RCC_PLLR_DIV2;
//   // if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
//   // {
//   //   Error_Handler();
//   // }
//   RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSI;
//   RCC_OscInitStruct.HSIState = RCC_HSI_ON;
//   RCC_OscInitStruct.HSICalibrationValue = RCC_HSICALIBRATION_DEFAULT;
//   RCC_OscInitStruct.PLL.PLLState = RCC_PLL_NONE;
//   if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
//   {
//     Error_Handler();
//   }

//   /** Initializes the CPU, AHB and APB buses clocks
//    */
//   // RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK | RCC_CLOCKTYPE_SYSCLK | RCC_CLOCKTYPE_PCLK1 | RCC_CLOCKTYPE_PCLK2;
//   // RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
//   // RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
//   // RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV1;
//   // RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV1;

//   // if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_4) != HAL_OK)
//   // {
//   //   Error_Handler();
//   // }
//   RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK | RCC_CLOCKTYPE_SYSCLK | RCC_CLOCKTYPE_PCLK1 | RCC_CLOCKTYPE_PCLK2;
//   RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_HSI;
//   RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
//   RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV1;
//   RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV1;

//   if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_0) != HAL_OK)
//   {
//     Error_Handler();
//   }
//   // HAL_RCC_MCOConfig(RCC_MCO1, RCC_MCO1SOURCE_PLLCLK, RCC_MCODIV_16);

//   //-----  copied from MSP files

//   GPIO_InitTypeDef GPIO_InitStruct = {};
//   RCC_PeriphCLKInitTypeDef PeriphClkInit = {};

//   __HAL_RCC_SYSCFG_CLK_ENABLE();
//   __HAL_RCC_PWR_CLK_ENABLE();

//   /** Initializes the peripherals clocks
//    */
//   PeriphClkInit.PeriphClockSelection = RCC_PERIPHCLK_USART1;
//   PeriphClkInit.Usart1ClockSelection = RCC_USART1CLKSOURCE_PCLK2;
//   if (HAL_RCCEx_PeriphCLKConfig(&PeriphClkInit) != HAL_OK)
//   {
//     Error_Handler();
//   }
//   SystemCoreClockUpdate();
// }
#include "stm32g4xx.h"

extern "C" void SystemClock_Config(void)
{
  RCC_OscInitTypeDef RCC_OscInitStruct = {};
  RCC_ClkInitTypeDef RCC_ClkInitStruct = {};

  /** Configure the main internal regulator output voltage
   */
  HAL_PWREx_ControlVoltageScaling(PWR_REGULATOR_VOLTAGE_SCALE1);

  /** Initializes the RCC Oscillators according to the specified parameters
   * in the RCC_OscInitTypeDef structure.
   */
  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSE;
  RCC_OscInitStruct.HSEState = RCC_HSE_ON;
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
  RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSE;
  // New PLLM for 12MHz HSE: 12MHz / 3 = 4MHz (VCO input frequency, must be 4-16MHz)
  RCC_OscInitStruct.PLL.PLLM = RCC_PLLM_DIV3;
  // New PLLN for 170MHz: 4MHz * 85 = 340MHz (VCO output frequency, must be 64-344MHz)
  RCC_OscInitStruct.PLL.PLLN = 85;
  // PLLR for 170MHz: 340MHz / 2 = 170MHz (SYSCLK)
  RCC_OscInitStruct.PLL.PLLP = RCC_PLLP_DIV2;
  RCC_OscInitStruct.PLL.PLLQ = RCC_PLLQ_DIV2;
  RCC_OscInitStruct.PLL.PLLR = RCC_PLLR_DIV2;
  if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
  {
    Error_Handler();
  }

  /** Initializes the CPU, AHB and APB buses clocks
   */
  RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK | RCC_CLOCKTYPE_SYSCLK | RCC_CLOCKTYPE_PCLK1 | RCC_CLOCKTYPE_PCLK2;
  RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
  RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
  RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV1;
  RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV1;

  // FLASH_LATENCY_4 is required for 170MHz SYSCLK
  if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_4) != HAL_OK)
  {
    Error_Handler();
  }

  //----- copied from MSP files (keep these as they are for peripheral clocks)
  GPIO_InitTypeDef GPIO_InitStruct = {};
  RCC_PeriphCLKInitTypeDef PeriphClkInit = {};

  __HAL_RCC_SYSCFG_CLK_ENABLE();
  __HAL_RCC_PWR_CLK_ENABLE();

  /** Initializes the peripherals clocks
   */
  PeriphClkInit.PeriphClockSelection = RCC_PERIPHCLK_USART1;
  PeriphClkInit.Usart1ClockSelection = RCC_USART1CLKSOURCE_PCLK2;
  if (HAL_RCCEx_PeriphCLKConfig(&PeriphClkInit) != HAL_OK)
  {
    Error_Handler();
  }
  SystemCoreClockUpdate();
}
